"use strict";
// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.
let i = 0;
while (i < 10) {
  i++;
  console.log(i);
}
// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
for (let i = 2; i < 20; i++) {
  if (i % 2 !== 0) {
    continue;
  }
  console.log(i);
}
// Вивести на екран таблицю множення числа 7 за допомогою циклу for.
for (let i = 1; i < 10; i++) {
  console.log(`7 * ${i} = ${7 * i}`);
}
//   Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while