// Вивести result в консоль. Перевірити тип змінної result= 5+5+’5’.
const result = 5 + 5 + "5";
console.log(result);
// Створити змінну, яка містить рядок з вашим ім'ям та прізвищем. Використовуючи метод .length, вивести в консоль кількість символів у рядку.
const info = "Владислав Кондратюк";
console.log(info.length);
// Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .toUpperCase(), перетворити рядок у верхній регістр та вивести результат в консоль.
const myName = "Влад";
console.log(myName.toUpperCase());
// Створити змінну, яка містить рядок з вашим ім'ям та прізвищем. Використовуючи метод .indexOf(), знайти і вивести в консоль позицію, на якій знаходиться пробіл між ім'ям та прізвищем.
const nameAndSurname = "Владислав Кондратюк";
console.log(nameAndSurname.indexOf( ));

